<a href="https://colab.research.google.com/github/UrsKindler/python_in_MS/blob/main/week%202%20Python%20sprint.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
print("Hello world")

Hello world

In [15]:
import pandas as pd

In [ ]:
January Sales:
   Region  Sales    Month
0   North  25000  January
1   South  30000  January
2    East  20000  January
3    West  15000  January

In [ ]:
   Region  Sales     Month
0   North  27000  February
1   South  32000  February
2   East   23000  February
3   West   18000  February

In [ ]:
March Sales:
   Region  Sales  Month
0   North  28000  March
1   South  31000  March
2    East  24000  March
3    West  20000  March

In [11]:
data_january  = {
    "Region" :["North", "South", "East", "West"],
    "Sales" :["25000", "30000", "20000", "15000"],
    "Month" :["January", "January", "January", "January"]
}

In [12]:
data_february  = {
    "Region" :["North", "South", "East", "West"],
    "Sales" :["27000", "32000", "23000", "18000"],
    "Month" :["February", "February", "February", "February"]
}

In [13]:
data_march = {
    "Region" :["North", "South", "East", "West"],
    "Sales" :["28000", "31000", "24000", "20000"],
    "Month" :["March", "March", "March", "March"]
}

In [17]:
data_jan = pd.DataFrame(data_january)
print(data_jan)

data_feb = pd.DataFrame(data_february)
print(data_feb)

data_mar = pd.DataFrame(data_march)
print(data_mar)

  Region  Sales    Month
0  North  25000  January
1  South  30000  January
2   East  20000  January
3   West  15000  January
  Region  Sales     Month
0  North  27000  February
1  South  32000  February
2   East  23000  February
3   West  18000  February
  Region  Sales  Month
0  North  28000  March
1  South  31000  March
2   East  24000  March
3   West  20000  March

In [19]:
df_concatenated = pd.concat([data_jan, data_feb, data_mar], axis=0)
print(df_concatenated)

  Region  Sales     Month
0  North  25000   January
1  South  30000   January
2   East  20000   January
3   West  15000   January
0  North  27000  February
1  South  32000  February
2   East  23000  February
3   West  18000  February
0  North  28000     March
1  South  31000     March
2   East  24000     March
3   West  20000     March

In [21]:
df_concatenated = pd.concat([data_jan, data_feb, data_mar], axis=0).reset_index(drop=True)
print(df_concatenated)

   Region  Sales     Month
0   North  25000   January
1   South  30000   January
2    East  20000   January
3    West  15000   January
4   North  27000  February
5   South  32000  February
6    East  23000  February
7    West  18000  February
8   North  28000     March
9   South  31000     March
10   East  24000     March
11   West  20000     March


It is time for a coding Challenge. Please concatenate the following DataFrames through rows. As you will see, there is some of the code done, you only have to replace the “___” part of the code. Good Luck!

In [22]:
import pandas as pd

# Create the first DataFrame
data1 = {
    'A': [1, 2, 3],
    'B': ['a', 'b', 'c']
}
df1 = pd.DataFrame(data1)
print(df1)

# Create the second DataFrame
data2 = {
    'A': [4, 5, 6],
    'B': ['d', 'e', 'f']
}
df2 = pd.DataFrame(data2)
print(df2)

# Concatenate along rows
concatenated_rows = pd.concat([df1, df2], axis=0, ignore_index=True) # Replace the "___"
print("Concatenated along rows:")
print(concatenated_rows)

   A  B
0  1  a
1  2  b
2  3  c
   A  B
0  4  d
1  5  e
2  6  f
Concatenated along rows:
   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e
5  6  f

In [25]:
data_1 = {
    "Product_ID": [101, 102, 103, 104],
    "Product_Name": ["Laptop", "Tablet", "Smartphone", "Monitor"],
    "Price": [1200, 500, 800, 300]
}

data_2 = {
    "Product_ID": [101, 102, 103, 105],
    "Category": ["Electronics", "Electronics", "Electronics", "Accessories"],
    "Stock": [50, 20, 100, 150]
}

df1 = pd.DataFrame(data_1)
print(df1)

df2 = pd.DataFrame(data_2)
print(df2)

   Product_ID Product_Name  Price
0         101       Laptop   1200
1         102       Tablet    500
2         103   Smartphone    800
3         104      Monitor    300
   Product_ID     Category  Stock
0         101  Electronics     50
1         102  Electronics     20
2         103  Electronics    100
3         105  Accessories    150

In [24]:
df_inner = pd.merge(df1, df2, on='Product_ID', how='inner')
print(df_inner)

   Product_ID Product_Name  Price     Category  Stock
0         101       Laptop   1200  Electronics     50
1         102       Tablet    500  Electronics     20
2         103   Smartphone    800  Electronics    100

In [26]:
data_1 = {
    "Product_ID": [101, 102, 103, 104],
    "Product_Name": ["Laptop", "Tablet", "Smartphone", "Monitor"],
    "Price": [1200, 500, 800, 300]
}

data_2 = {
    "Product_ID": [101, 102, 103],
    "Category": ["Electronics", "Electronics", "Accessories"],
    "Stock": [50, 20, 150]
}

df1 = pd.DataFrame(data_1)
print(df1)

df2 = pd.DataFrame(data_2)
print(df2)

   Product_ID Product_Name  Price
0         101       Laptop   1200
1         102       Tablet    500
2         103   Smartphone    800
3         104      Monitor    300
   Product_ID     Category  Stock
0         101  Electronics     50
1         102  Electronics     20
2         103  Accessories    150

In [27]:
df_left = pd.merge(df1, df2, on = "Product_ID", how= "left")
print(df_left)

   Product_ID Product_Name  Price     Category  Stock
0         101       Laptop   1200  Electronics   50.0
1         102       Tablet    500  Electronics   20.0
2         103   Smartphone    800  Accessories  150.0
3         104      Monitor    300          NaN    NaN

In [28]:
data_1 = {
    "Product_ID": [101, 102, 103, 104],
    "Product_Name": ["Laptop", "Tablet", "Smartphone", "Monitor"],
    "Price": [1200, 500, 800, 300]
}

data_2 = {
    "Product_ID": [101, 102, 105],
    "Category": ["Electronics", "Electronics", "Accessories"],
    "Stock": [50, 20, 150]
}

df1 = pd.DataFrame(data_1)
print(df1)

df2 = pd.DataFrame(data_2)
print(df2)

   Product_ID Product_Name  Price
0         101       Laptop   1200
1         102       Tablet    500
2         103   Smartphone    800
3         104      Monitor    300
   Product_ID     Category  Stock
0         101  Electronics     50
1         102  Electronics     20
2         105  Accessories    150

In [29]:
df_right = pd.merge(df1, df2, on= "Product_ID", how= "right")

print(df_right)

   Product_ID Product_Name   Price     Category  Stock
0         101       Laptop  1200.0  Electronics     50
1         102       Tablet   500.0  Electronics     20
2         105          NaN     NaN  Accessories    150

In [30]:
df_outer = pd.merge(df1, df2, on= "Product_ID", how="outer")
print(df_outer)

   Product_ID Product_Name   Price     Category  Stock
0         101       Laptop  1200.0  Electronics   50.0
1         102       Tablet   500.0  Electronics   20.0
2         103   Smartphone   800.0          NaN    NaN
3         104      Monitor   300.0          NaN    NaN
4         105          NaN     NaN  Accessories  150.0

Let’s join tables! In this case select a join that will keep all rows from the left DataFrame with matched rows from the right DataFrame. As with the previous coding challenge, some of the code is already written; you only need to replace the '___' part. Good luck!

In [31]:
import pandas as pd

# Create the first DataFrame (left)
data1 = {
    'ID': [1, 2, 3, 4, 5, 6, 7],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace']
}
df1 = pd.DataFrame(data1)

# Create the second DataFrame (right)
data2 = {
    'ID': [2, 3, 5, 6, 8, 9, 10],
    'Age': [25, 30, 22, 28, 35, 40, 45]
}
df2 = pd.DataFrame(data2)

# Perform a left join on the 'ID' column
merged_df = pd.merge(df1, df2, on="ID", how="left") # replace the "___"

print("Merged DataFrame with Left Join:")
print(merged_df)

Merged DataFrame with Left Join:
   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  25.0
2   3  Charlie  30.0
3   4    David   NaN
4   5      Eve  22.0
5   6    Frank  28.0
6   7    Grace   NaN

          Name   Age Date Joined           Salary            Remarks
0     John Doe  28.0  01/15/2020            50000      Good employee
1     John Doe  32.0  02/20/2021            60000                N/A
2     John Doe  45.0  03/10/2019            75000          Excellent
3     John Doe   NaN  01/01/2020            50000      Good employee
4     John Doe  28.0  05/25/2018  Eighty Thousand                N/A
5     John Doe  32.0  06/15/2020            52000  Needs improvement
6     John Doe   NaN  07/01/2019            75000                   
7     John Doe  30.0  01/15/2020            60000                N/A
8     John Doe  45.0  07/01/2019            75000               None
9     John Doe  50.0  06/15/2020            52000      Good employee
10  Jane Smith  32.0  04/25/2020            75000          Excellent
11  Jane Smith  33.0  04/25/2020            80000          Excellent
12  Jane Smith   NaN  03/10/2019            80000               Fair
13  Jane Smith  36.0  03/15/2020            52000           New hire
14  Jane Smith  36.0  02/25/2020            50000                   
15  Jane Smith  29.0  01/01/2020            60000      Good employee
16  Jane Smith  28.0  06/15/2020            75000                N/A
17  Jane Smith   NaN  07/01/2019           100000                   
18  Jack Brown  40.0  08/25/2020            85000  Needs improvement
19  Jack Brown  41.0  09/10/2021            90000               None
20  Jack Brown  42.0  10/02/2019            95000          Promising
21  Jack Brown   NaN  11/11/2018            62000                   
22  Jack Brown  55.0  12/12/2020           120000      Good employee
23  Sam Wilson  58.0  01/15/2021           110000  Needs improvement
24  Sam Wilson  60.0        None            88000               None
25  Sam Wilson  30.0  06/15/2020             None          Excellent
26  Sam Wilson   NaN  01/15/2021   Sixty Thousand                   
27        None  45.0  07/01/2019           102000               Fair
28        None  50.0  06/15/2020             None                   
29        None  50.0        None            70000          Promising

In [32]:
import pandas as pd

data = {
    'Name': ['John Doe'] * 10 + ['Jane Smith'] * 8 + ['Jack Brown'] * 5 + ['Sam Wilson'] * 4 + [None] * 3,
    'Age': [28.0, 32.0, 45.0, None, 28.0, 32.0, None, 30.0, 45.0, 50.0,
            32.0, 33.0, None, 36.0, 36.0, 29.0, 28.0, None,
            40.0, 41.0, 42.0, None, 55.0,
            58.0, 60.0, 30.0, None,
            45.0, 50.0, 50.0],
    'Date Joined': ['01/15/2020', '02/20/2021', '03/10/2019', '01/01/2020', '05/25/2018', '06/15/2020', '07/01/2019', '01/15/2020', '07/01/2019', '06/15/2020',
                    '04/25/2020', '04/25/2020', '03/10/2019', '03/15/2020', '02/25/2020', '01/01/2020', '06/15/2020', '07/01/2019',
                    '08/25/2020', '09/10/2021', '10/02/2019', '11/11/2018', '12/12/2020',
                    '01/15/2021', None, '06/15/2020', '01/15/2021',
                    '07/01/2019', '06/15/2020', None],
    'Salary': [50000, 60000, 75000, 50000, 'Eighty Thousand', 52000, 75000, 60000, 75000, 52000,
               75000, 80000, 80000, 52000, 50000, 60000, 75000, 100000,
               85000, 90000, 95000, 62000, 120000,
               110000, 88000, None, 'Sixty Thousand',
               102000, None, 70000],
    'Remarks': ['Good employee', 'N/A', 'Excellent', 'Good employee', 'N/A', 'Needs improvement', '', 'N/A', None, 'Good employee',
                'Excellent', 'Excellent', 'Fair', 'New hire', '', 'Good employee', 'N/A', '',
                'Needs improvement', None, 'Promising', '', 'Good employee',
                'Needs improvement', None, 'Excellent', '',
                'Fair', '', 'Promising']
}

# Erstellen des DataFrames
df = pd.DataFrame(data)

# Anzeigen des DataFrames
print(df)

          Name   Age Date Joined           Salary            Remarks
0     John Doe  28.0  01/15/2020            50000      Good employee
1     John Doe  32.0  02/20/2021            60000                N/A
2     John Doe  45.0  03/10/2019            75000          Excellent
3     John Doe   NaN  01/01/2020            50000      Good employee
4     John Doe  28.0  05/25/2018  Eighty Thousand                N/A
5     John Doe  32.0  06/15/2020            52000  Needs improvement
6     John Doe   NaN  07/01/2019            75000
7     John Doe  30.0  01/15/2020            60000                N/A
8     John Doe  45.0  07/01/2019            75000               None
9     John Doe  50.0  06/15/2020            52000      Good employee
10  Jane Smith  32.0  04/25/2020            75000          Excellent
11  Jane Smith  33.0  04/25/2020            80000          Excellent
12  Jane Smith   NaN  03/10/2019            80000               Fair
13  Jane Smith  36.0  03/15/2020            52000           New hire
14  Jane Smith  36.0  02/25/2020            50000
15  Jane Smith  29.0  01/01/2020            60000      Good employee
16  Jane Smith  28.0  06/15/2020            75000                N/A
17  Jane Smith   NaN  07/01/2019           100000
18  Jack Brown  40.0  08/25/2020            85000  Needs improvement
19  Jack Brown  41.0  09/10/2021            90000               None
20  Jack Brown  42.0  10/02/2019            95000          Promising
21  Jack Brown   NaN  11/11/2018            62000
22  Jack Brown  55.0  12/12/2020           120000      Good employee
23  Sam Wilson  58.0  01/15/2021           110000  Needs improvement
24  Sam Wilson  60.0        None            88000               None
25  Sam Wilson  30.0  06/15/2020             None          Excellent
26  Sam Wilson   NaN  01/15/2021   Sixty Thousand
27        None  45.0  07/01/2019           102000               Fair
28        None  50.0  06/15/2020             None
29        None  50.0        None            70000          Promising

In [33]:
df.head()

       Name   Age Date Joined           Salary        Remarks
0  John Doe  28.0  01/15/2020            50000  Good employee
1  John Doe  32.0  02/20/2021            60000            N/A
2  John Doe  45.0  03/10/2019            75000      Excellent
3  John Doe   NaN  01/01/2020            50000  Good employee
4  John Doe  28.0  05/25/2018  Eighty Thousand            N/A

In [34]:
df.shape

(30, 5)

In [35]:
df.dtypes

Name            object
Age            float64
Date Joined     object
Salary          object
Remarks         object
dtype: object

In [36]:
df.isnull().sum()

Name           3
Age            6
Date Joined    2
Salary         2
Remarks        3
dtype: int64

In [37]:
df.duplicated().sum()

0

In [38]:
df['Salary'].unique()

array([50000, 60000, 75000, 'Eighty Thousand', 52000, 80000, 100000,
       85000, 90000, 95000, 62000, 120000, 110000, 88000, None,
       'Sixty Thousand', 102000, 70000], dtype=object)

💪
It is time for some Data Assessment. Now you now, some of the code is already written; you only need to replace the '___' part. Good luck!
Check the first rows of the DataFrame
Check the number of rows and columns in the DataFrame
Check the data types of each column
Check the number of missing values in the DataFrame
Check how many duplicated rows are in the DataFrame
Check inconsistencies in the unique values of  City Column

In [42]:
import pandas as pd
import numpy as np

# Create a sample DataFrame with intentional issues

data = {
    'ID': [1, 2, 3, 4, 2, 5, 6, np.nan, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Bob', 'Eve', 'Frank', None, 'Charlie', 'David'],
    'Age': [25, 30, 22, 28, 30, 40, 35, 28, 'unknown', 28],
    'City': ['New York', 'los angeles', 'chicago', 'Houston', 'Los Angeles', 'chiCaGo', 'Chicago', 'Miami', 'chicago', 'Houston']
}

df = pd.DataFrame(data)

# Check the first rows of the DataFrame

print(df.head(1))  # Replace the "___"

# Check the number of rows and columns in the DataFrame

print('\nShape of the DataFrame:')
print(df.shape)  # Replace the "___"

# Check the data types of each column

print('\nData Types of Each Column:')
print(df.dtypes)  # Replace the "___"

# Check the number of missing values in the DataFrame

print('\nMissing Values in the DataFrame:')
print(df.isnull().sum())  # Replace the "___"

# Check how many duplicated rows are in the DataFrame

print('\nChecking Duplicate Rows:')
print(df.duplicated().sum())  # Replace the "___"

# Check inconsistencies in the unique values of  City Column

print('\nUnique Values of the City Column:')
print(df['City'].unique())  # Replace the "___"

    ID   Name Age      City
0  1.0  Alice  25  New York

Shape of the DataFrame:
(10, 4)

Data Types of Each Column:
ID      float64
Name     object
Age      object
City     object
dtype: object

Missing Values in the DataFrame:
ID      1
Name    1
Age     0
City    0
dtype: int64

Checking Duplicate Rows:
1

Unique Values of the City Column:
['New York' 'los angeles' 'chicago' 'Houston' 'Los Angeles' 'chiCaGo'
 'Chicago' 'Miami']

This challenge is for you to practice handling missing values. Having seen the criteria that should guide you in removing null values at the row or column level, implement the method in Python with a configuration that allows for the elimination of null values while losing the least amount of records. As always, replace the “___”. Good Luck!

In [43]:

import pandas as pd
import numpy as np

# Sample dataset
data = {
    'Age': [25, np.nan, 35, 45, np.nan, 50],
    'Salary': [50000, 60000, np.nan, 80000, 90000, np.nan],
    'City': ['New York', 'Los Angeles', 'New York', np.nan, 'San Francisco', 'Chicago']
}

df = pd.DataFrame(data)

# Display the dataset
print("Original Data:\n", df)

# Task 1: Fill missing numeric values with the mean of the column
df['Age'].fillna(df["Age"].mean(), inplace=True)
df['Salary'].fillna(df["Salary"].mean(), inplace=True)

# Task 2: Fill missing categorical values with the mode (most frequent value)
df['City'].fillna(df['City'].mode()[0], inplace=True)

print("\nData after filling missing values:\n", df)

Original Data:
     Age   Salary           City
0  25.0  50000.0       New York
1   NaN  60000.0    Los Angeles
2  35.0      NaN       New York
3  45.0  80000.0            NaN
4   NaN  90000.0  San Francisco
5  50.0      NaN        Chicago

Data after filling missing values:
      Age   Salary           City
0  25.00  50000.0       New York
1  38.75  60000.0    Los Angeles
2  35.00  70000.0       New York
3  45.00  80000.0       New York
4  38.75  90000.0  San Francisco
5  50.00  70000.0        Chicago

<ipython-input-43-91436a10cad3>:17: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df["Age"].mean(), inplace=True)
<ipython-input-43-91436a10cad3>:18: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df["Salary"].mean(), inplace=True)
<ipython-input-43-91436a10cad3>:21: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna(df['City'].mode()[0], inplace=True)


It is now time for a code challenge. Drop the duplicate rows considering the “Name” and “City” columns. Replace the “___”. Good Luck!

In [44]:
import pandas as pd

data = {
    'Name': ['Alice', 'Alice', 'Alice', 'Alice', 'Bob', 'Charlie', 'David'],
    'Age': [30, 31, 32, 33, 25, 40, 35],
    'City': ['New York', 'New York', 'New York', 'New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [70000, 72000, 71000, 73000, 80000, 120000, 90000]
}

df = pd.DataFrame(data)

# Drop duplicates based on 'Name' and 'City'

df_dropped_duplicates = df.drop_duplicates(subset=["Name", "City"])  # Replace the "___"

print("\nDataFrame after dropping duplicates based on 'Name' and 'City':")
print(df_dropped_duplicates)

DataFrame after dropping duplicates based on 'Name' and 'City':
      Name  Age         City  Salary
0    Alice   30     New York   70000
4      Bob   25  Los Angeles   80000
5  Charlie   40      Chicago  120000
6    David   35      Houston   90000

Let’s say we want to calculate the average weight, height and speed of the members of the following DataFrame. Replace the “___” in order to be able to do that.

In [47]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Weight': ['55.5', '70.2', '66.3', '80.4'],
    'Height': [1.65, 1.75, 1.80, 1.70],
    'Speed': [10.5, 12.0, 11.3, 9.8]
}

df = pd.DataFrame(data)

df['Weight'] = df['Weight'].astype(float)
print(df['Speed'].mean())
print(df['Weight'].mean())
print(df['Height'].mean())

10.899999999999999
68.1
1.725

Now is your turn to clean the Data. Replace the “___” in order to get your data clean! Good Luck!

In [49]:
import pandas as pd

data = {'Product': ['   Apple    ', 'banana', '  ORANGE  ', 'kiwifruit '
        , 'grapes'], 'Sales': ['100$', ' 200$ ', '  150$ ', '120$  ',
        '  90$ '], 'Place': ['North America - USA',
        'South America - Brazil', 'Europe - France', 'Asia - Japan',
        'Australia - Australia']}

sales_df = pd.DataFrame(data)

# Correct product capitalization

sales_df['Product'] = sales_df['Product'].str.capitalize()

# Stripp the whitespaces of all the columns

sales_df['Product'] = sales_df['Product'].str.strip()
sales_df['Sales'] = sales_df['Sales'].str.strip()
sales_df['Place'] = sales_df['Place'].str.strip()

# Splitting 'Place' into new columns: 'Region' and 'Country'

sales_df[['Region', 'Country']] = sales_df['Place'].str.split('-', n=1,
        expand=True)

# Replacing characters (e.g., replacing "$" with " ")

sales_df['Sales'] = sales_df['Sales'].str.replace('\$', " ", regex=True)

print('\nSales DataFrame after String Cleaning Operations:')
print(sales_df)

Sales DataFrame after String Cleaning Operations:
     Product Sales                   Place     Region           Country
0      apple  100$     North America - USA      North     America - USA
1     Banana  200$  South America - Brazil      South  America - Brazil
2     orange  150$         Europe - France     Europe          - France
3  Kiwifruit  120$            Asia - Japan       Asia           - Japan
4     Grapes   90$   Australia - Australia  Australia       - Australia

Coding Challenge time. Imagine your boss give you the following DataFrame and ask you to calculate the total sales by region and the mean sales by region. Replace the “___”. Good Luck!

In [50]:
import pandas as pd
import numpy as np

data = {
    'product': ['Apple', 'Banana', 'Orange', 'Grapes', 'Apple', 'Banana', 'Orange', 'Grapes', 'Apple', 'Banana', 'Orange', 'Grapes', 'Apple', 'Banana', 'Orange', 'Grapes'],
    'region': ['North America', 'North America', 'North America', 'North America', 'South America', 'South America', 'South America', 'South America', 'Europe', 'Europe', 'Europe', 'Europe', 'Asia', 'Asia', 'Asia', 'Asia'],
    'sales': [100, 150, 200, 120, 80, 90, 130, 110, 140, 160, 120, 130, 180, 190, 210, 220]
}

sales_df = pd.DataFrame(data)

# Group by region and calculate the total sales
# Replace the "___" below
print(sales_df.groupby('region')['sales'].sum().reset_index())

# Calculate the mean sales by region
# Replace the "___" below
print(sales_df.groupby('region')['sales'].mean().reset_index())

          region  sales
0           Asia    800
1         Europe    550
2  North America    570
3  South America    410
          region  sales
0           Asia  200.0
1         Europe  137.5
2  North America  142.5
3  South America  102.5

This is the final coding challenge of the sprint. I know you can do it! Create a pivot table for total sales by region and another one with the mean sales by region. Good Luck!

In [51]:
import pandas as pd

data = {'product': [
    'Apple',
    'Banana',
    'Orange',
    'Grapes',
    'Apple',
    'Banana',
    'Orange',
    'Grapes',
    'Apple',
    'Banana',
    'Orange',
    'Grapes',
    'Apple',
    'Banana',
    'Orange',
    ], 'region': [
    'North America',
    'North America',
    'North America',
    'North America',
    'South America',
    'South America',
    'South America',
    'South America',
    'Europe',
    'Europe',
    'Europe',
    'Europe',
    'Asia',
    'Asia',
    'Asia',
    ], 'sales': [
    100,
    150,
    200,
    120,
    80,
    90,
    130,
    110,
    140,
    160,
    120,
    130,
    180,
    190,
    210,
    ]}
sales_df = pd.DataFrame(data)

# Create a pivot table for total sales by region

total_sales_pivot = sales_df.pivot_table(values='sales', index='region',
        aggfunc='sum').reset_index()  # Replace the "___"
                                      # Replace the "___"
                                      # Replace the "___"
print('Total Sales Pivot', total_sales_pivot)

# Create a pivot table for mean sales by region

mean_sales_pivot = sales_df.pivot_table(values='sales', index='region',
        aggfunc='mean').reset_index()  # Replace the "___"
                                      # Replace the "___"
                                      # Replace the "___"
print('\n Mean Sales Pivot', mean_sales_pivot)

Total Sales Pivot           region  sales
0           Asia    580
1         Europe    550
2  North America    570
3  South America    410

 Mean Sales Pivot           region       sales
0           Asia  193.333333
1         Europe  137.500000
2  North America  142.500000
3  South America  102.500000